Revit 2024 API
ForgeTypeId.Clear Method
 Sets the typeId to an empty string
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ForgeTypeId Clear()
Visual Basic
Public Function Clear As ForgeTypeId
Visual C++
public:
ForgeTypeId^ Clear()
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace